#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "rus");
	//8. Даны натуральные числа от 20 до 50.Напечатать те из них, которые делятся на 3, но не делятся на 5.
	/*for (int i = 20; i <= 50; i++)
	{
		if (i % 3 == 0 && i % 5 != 0) {
			cout << i << endl;
		}
	}*/
	//9. даны натуральные числа от 35 до 87. Найти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5.
	/*for (int i = 35; i <= 87; i++) {
		if (i % 7 == 1 || i % 7 == 2 || i % 7 == 5) {
			cout << i << " ";
		}
	}*/
	//10. Даны натуральные числа от 1 до 50. Найти сумму тех из них, которые делятся на 5 или на 7.
	/*int sum = 0;
	for (int i = 1; i <= 50; i++)
	{
		if (i % 5 == 0 || i % 7 == 0) {
			sum = sum + i;
		}
	}
	cout << sum << endl;*/
	//11. Напечатать те из двузначных чисел которые делятся на 4, но не делятся на 6.
	/*for (int i = 10; i <= 99; i++)
	{
		if (i%4==0 && i%6!=0)
		{
			cout << i << " ";
		}
	}*/
	//12. Найти произведение двузначных нечетных чисел кратных 13.
	/*int pr = 1;
	for (int i = 11; i <= 99; i=i+2)
	{
		if (i % 13 == 0) {
			pr = pr * i;
		}
	}
	cout << pr << endl;*/
	//13. Найти сумму чисел от 100 до 200 кратных 17.
	/*int sum = 0;
	for (int i = 100; i <= 200; i++)
	{
		cout << i << " ";
		if (i % 17 == 0) {
			sum += i;
		}
	}
	cout << sum << endl;*/
	//14. Составьте программу, которая вычисляет сумму квадратов чисел от 1 до введенного вами целого числа N
	/*int N,sum=0;
	cout << "Введите количество чисел: " << endl;
	cin >> N;
	for (int i = 1; i < N; i++)
	{
		sum = sum + (i * i);
	}
	cout << "Сумма квадратов чисел от 1 до " << N << ":" << sum << endl;*/
	//16. В бригаде, работающей на уборке сена, имеется N сенокосилок.Первая сенокосилка работала m часов, а каждая следующая на 10 минут больше, чем предыдущая.Сколько часов проработала вся бригада ?
	/*int N, m;
	double ch = 0;
	cout << "Задайте количество сенокосилок N и время работы первой m" << endl;
	cin >> N >> m;
	for (int i = 1; i <= N; i++)
	{
		ch = ch + m;
		m = m + 10;
	}
	ch = ch / 60;
	cout << ch << " часов" << endl;*/
	//17. В ЭВМ вводятся по очереди данные о росте N учащихся класса.Определить средний рост учащихся класса.
	/*int N,rost,sr,sum=0;
	cout << "Введите количество учеников в классе : ";
	cin >> N;
	for (int i = 1; i <= N; i++)
	{
		cout << "Введите рост " << i << " ученика:" << endl;
		cin >> rost;
		sum = sum + rost;
	}
	sr = sum / N;
	cout << "Средний рост учеников в классе: " << sr << endl;*/
	//18. Задано натуральное число N.Найти количество натуральных чисел, не превосходящих N и не делящихся ни на одно из чисел 2, 3, 5.
	/*int N,sum=0;
	cout << "Задайте натуральное число N: " << endl;
	cin >> N;
	for (int i = 1; i <= N; i++)
	{
		if (i % 2 != 0 && i % 3 != 0 && i % 5 != 0) {
			sum++;
		}
	}
	cout << "Количество натуральных чисел < N и не делящихся на 2,3,5: "<< sum << endl;*/
	//19. Два двузначных числа, записанных одно за другим, образуют четырёхзначное число, которое делится на их произведение.Найти эти числа.
	int perv, vtor;
	for (int i = 1000; i <= 9999; i++)
	{
		perv = i / 100;
		vtor = i % 100;
		if (i%(perv*vtor)==0)
		{
			cout << perv << " " << vtor << endl;
		}
		
	}
	


}
